Switch>
Switch>enable
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.

Switch(config)#
enable       Modify enable password parameters
end          Exit from Configure Mode
exit         Exit from Configure Mode
hostname     Set system's network name
interface    interface
ip           Global IP configuration subcommands
line         Configure a terminal line
vlan         VLan Commands
Switch(config)#hostname Matheus
Matheus(config)#end
*Nov 12 23:00:12.955: %SYS-5-CONFIG_I: Configured from console by console
Matheus#
Matheus#
Matheus#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.

Matheus(config)#interface fastethernet 0/1
Matheus(config-if)#description this is the connection to PC1
Matheus(config-if)#exit
Matheus(config)#enable secret cs
Matheus(config)#end
*Nov 12 23:02:03.981: %SYS-5-CONFIG_I: Configured from console by console
Matheus#disable
Matheus>enable
Password:
Matheus#
Matheus#
