*Dez 3 00:06:48.591: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to up
Press RETURN to get started.

Switch>
Switch>enable
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.

Switch(config)#line vty 0 15
Switch(config-line)#password cs
Switch(config-line)#login
Switch(config-line)#enable secret its-a-secret
Switch(config)#
*Dez 3 00:12:06.474: %SYS-5-CONFIG_I: Configured from console by console

Switch#exit

Press RETURN to get started.

Switch>


----------------------------//--------------------------------------------------------------------------------

//Accessing the same switch using a router

*Dez 3 00:06:48.585: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
Press RETURN to get started.

Router>
Router>
Router>telnet 10.1.1.5
Trying 10.1.1.5 ... Open

User Access Verification

Password:
Password:
Switch>
Switch>
Switch>enable
Password:
Switch#
Switch#
Switch#
configure    Enter configuration mode
copy         Copy from one file to another
disable      Turn off privileged commands
enable       Turn on privileged commands
exit         Exit from the EXEC
ping         ping
show         show interfaces
telnet       Open a telnet connection
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.

Switch(config)#hostname Matheus
Matheus(config)#exit
*Dez 3 00:15:35.989: %SYS-5-CONFIG_I: Configured from console by console
Matheus#
Matheus#
Matheus#
Matheus#exit
Router>
Router>
Router>
Router>
Router>telnet 10.1.1.5
Trying 10.1.1.5 ... Open

User Access Verification

Password:
Password:
Matheus>
Matheus>
